<template>
    <view class="agreement-register">
        <text class="title">乐开花用户协议</text>
        <text class="content strong">本服务协议具有合同效力。您确认本服务协议后，本服务协议即在您和乐开花之间产生法律效力。请您务必在注册之前认真阅读全部服务协议内容，如有任何疑问，可向乐开花咨询。 无论您事实上是否在注册之前认真阅读了本服务协议，只要您通过乐开花网站以及相关网站、移动设备客户端注册成为乐开花用户，您的行为仍然表示您同意并签署了本服务协议</text>
        <text class="content strong">1、乐开花服务条款的确认和接纳</text>
        <text class="content">乐开花各项服务的所有权和运作权归乐开花拥有。</text>
        <text class="content strong">2、您必须：</text>
        <text class="content">自行配备上网的所需设备， 包括个人电脑、调制解调器或其他必备上网装置。自行负担个人上网所支付的与此服务有关的电话费用、 网络费用。</text>
        <text class="content strong">3、有关个人资料</text>
        <text class="content">您同意：</text>
        <text class="content">(1) 提供详细及准确的个人资料。</text>
        <text class="content">(2).同意接收来自乐开花的信息。</text>
        <text class="content">(3) 不断更新注册资料，符合及时、详尽准确的要求。所有原始键入的资料将引用为注册资料。</text>
        <text class="content strong">4、服务条款的修改</text>
        <text class="content">乐开花有权在必要时修改服务条款，乐开花服务条款一旦发生变动，将会在重要页面上提示修改内容。如果不同意所改动的内容，您可以主动取消获得的乐开花的信息服务。如果您继续享用乐开花的信息服务，则视为接受服务条款的变动。乐开花保留随时修改或中断服务而不需通知用户的权利。乐开花行使修改或中断服务的权利，不需对用户或第三方负责。</text>
        <text class="content strong">5、用户的帐号、密码和安全性</text>
        <text class="content">您一旦注册成功成为用户，您将得到一个密码和帐号。如果您不保管好自己的帐号和密码安全，将负全部责任。另外，每个用户都要对其帐户中的所有活动和事件负全责。您可随时根据指示改变您的密码，原则上每个用户只允许开设一个乐开花账户。用户同意若发现任何非法使用用户帐号或安全漏洞的情况，请立即通知乐开花。</text>
        <text class="content strong">6、拒绝提供担保</text>
        <text class="content">您明确同意信息服务的使用由您个人承担风险。乐开花不担保服务不会受中断，对服务的及时性，安全性，出错发生都不作担保，但会在能力范围内，避免出错。</text>
        <text class="content strong">7、有限责任</text>
        <text class="content">乐开花对任何直接、间接、偶然、特殊及继起的损害不负责任，这些损害来自：不正当使用乐开花服务，或用户传送的信息不符合规定等。这些行为都有可能导致乐开花形象受损，所以乐开花事先提出这种损害的可能性，同时会尽量避免这种损害的发生。</text>
        <text class="content strong">8、信息的储存及限制</text>
        <text class="content">您必须遵循：</text>
        <text class="content">(1) 使用信息服务不作非法用途</text>
        <text class="content">(2) 不干扰或混乱网络服务。</text>
        <text class="content">(3) 遵守所有使用服务的网络协议、规定、程序和惯例。用户的行为准则是以因特网法规，政策、程序和惯例为根据的。</text>
        <text class="content">(4) 个人会员同意，乐开花有权在提供乐开花服务过程中以各种方式投放各种商业性广告或其他任何类型的商业信息（包括但不限于在乐开花贷款咨询平台的任何页面上投放广告），并且，个人会员同意接受乐开花通过短信或其他方式向个人会员发送商品促销或其他相关商业信息。</text>
        <text class="content strong">9、用户管理</text>
        <text class="content">乐开花有判定您的行为是否符合乐开花服务条款的要求和精神的权利，如果您违背乐开花服务条款的规定，乐开花有权中断其服务的帐号。</text>
        <text class="content strong">10、保障</text>
        <text class="content">您同意保障和维护乐开花全体成员的利益，负责支付由您使用超出服务范围引起的律师费用，违反服务条款的损害补偿费用，其它人使用您的电脑、帐号和其它知识产权的追索费。</text>
        <text class="content strong">11、结束服务</text>
        <text class="content">您或乐开花可随时根据实际情况中断一项或多项服务。乐开花不需对任何个人或第三方负责而随时中断服务。您若反对任何服务条款的建议或对后来的条款修改有异议，或对乐开花服务不满，您可以行使如下权利：</text>
        <text class="content">(1) 不再使用乐开花信息服务。</text>
        <text class="content">(2) 通知乐开花停止对您的服务。</text>
        <text class="content">乐开花束对您的服务后，您使用乐开花服务的权利马上中止。从那时起，您没有权利，乐开花也没有义务传送任何未处理的信息或未完成的服务给您或第三方。</text>
        <text class="content strong">12、通告</text>
        <text class="content">所有发给您的通告都可通过重要页面的公告或电子邮件或常规的信件传送。服务条款的修改、服务变更、或其它重要事件的通告都会以此形式进行。</text>
        <text class="content strong">13、信息内容的所有权</text>
        <text class="content">乐开花定义的信息内容包括：文字、软件、声音、相片、录象、图表；在广告中全部内容；乐开花为您提供的其它信息。所有这些内容受版权、商标、标签和其它财产所有权法律的保护。所以，您只能在乐开花和广告商授权下才能使用这些内容，而不能擅自复制、再造这些内容、或创造与内容有关的派生产品。</text>
        <text class="content strong">14、法律</text>
        <text class="content">乐开花信息服务条款要与中华人民共和国的法律解释一致。您和乐开花一致同意服从乐开花所在地有管辖权的法院管辖。</text>
        <text class="content strong">15、用户信息及隐私权保护</text>
        <text class="content">（1）用户信息的提供、搜集及核实</text>
        <text class="content">您有义务在注册时提供自己的真实资料，并保证诸如电子邮件地址、联系电话、联系地址、邮政编码等内容的有效性、安全性和及时更新，以便乐开花为您提供服务并与您进行及时、有效的联系。您应完全独自承担因通过这些联系方式无法与您取得联系而导致的您在使用本服务过程中遭受的任何损失或增加任何费用等不利后果。</text>
        <text class="content">乐开花可能自公开及私人资料来源收集您的额外资料，以更好地了解你乐开花用户，并为其度身订造乐开花服务、解决争议和确保在网站进行交易的安全性。乐开花仅收集乐开花认为就此目的及达成该目的所必须的关于您的个人资料。</text>
        <text class="content">您同意乐开花可以自行或通过合作的第三方机构对您提交或乐开花搜集的用户信息（包括但不限于您的个人身份证信息等）进行核实，并对获得的核实结果根据本协议及有关文件进行查看、使用和留存等操作。</text>
        <text class="content">乐开花按照您在乐开花上的行为自动追踪关于您的某些资料。乐开花利用这些资料进行有关乐开花之用户的人口统计、兴趣及行为的内部研究，以更好地了解您以便向您和乐开花的其他用户提供更好的服务。</text>
        <text class="content">乐开花在乐开花的某些网页上使用诸如“Cookies”的资料收集装置。“Cookies”是设置在您的硬盘上的小档案，以协助乐开花为您提供度身订造的服务。乐开花亦提供某些只能通过使用“Cookies”才可得到的功能。乐开花还利用“Cookies”使您能够在某段期间内减少输入密码的次数。“Cookies”还可以协助乐开花提供专门针对您的兴趣而提供的资料。如果您将个人通讯信息（例如：手机短信、电邮或信件）交付给乐开花，或如果其他用户或第三方向乐开花发出关于您在乐开花的活动或登录事项的通讯信息，乐开花可以将这些资料收集在您的专门档案中。</text>
        <text class="content">（2）用户信息的使用和披露</text>
        <text class="content">您同意乐开花可使用关于您的个人资料（包括但不限于乐开花持有的有关您的档案中的资料，及乐开花从您目前及以前在乐开花上的活动所获取的其他资料）以解决争议、对纠纷进行调停、确保在乐开花进行安全交易，并执行乐开花的服务协议及相关规则。乐开花有时候可能调查多个用户以识别问题或解决争议，特别是乐开花可审查您的资料以区分使用多个用户名或别名的用户。为限制在网站上的欺诈、非法或其他刑事犯罪活动，使乐开花免受其害，您同意乐开花可通过人工或自动程序对您的个人资料进行评价。</text>
        <text class="content">您同意乐开花可以使用您的个人资料以改进乐开花的推广和促销工作、分析网站的使用率、改善乐开花的内容和产品推广形式，并使乐开花的网站内容、设计和服务更能符合用户的要求。这些使用能改善乐开花的网页，以调整乐开花的网页使其更能符合您的需求，从而使您在使用乐开花服务时得到更为顺利、有效、安全及度身订造的贷款咨询体验。您同意乐开花利用您的资料与您联络并（在某些情况下）向您传递针对您的兴趣而提供的信息，例如：有针对性的广告条、行政管理方面的通知、产品提供以及有关您使用乐开花的通讯。您接受本协议即视为您同意收取这些资料。</text>
        <text class="content">您注册成功后应妥善保管您的用户名和密码。您确认，无论是您还是您的代理人，用您的用户名和密码登录乐开花旗下产品后在乐开花的一切行为均代表您并由您承担相应的法律后果。</text>
        <text class="content">乐开花对于您提供的、自行收集到的、经认证的个人信息将按照本协议及有关规则予以保护、使用或者披露。乐开花将采用行业标准惯例以保护您的个人资料，但鉴于技术限制，乐开花不能确保您的全部私人通讯及其他个人资料不会通过本协议中未列明的途径泄露出去。您使用乐开花服务进行交易时，为便于乐开花核查您的的个人信息、信用情况、风险承受能力等促成交易的必要信息，以及便于乐开花协助进行催收等履行必要义务，您在此不可撤销地授权乐开花将您的个人信息以及交易信息等必要信息提供给中国互联网金融协会互联网金融服务平台、乐开花合作的第三方征信平台（如芝麻信用、前海征信、鹏元征信、考拉征信等）、乐开花合作的其他大数据信息核查以及反欺诈核查公司、乐开花合作方委托的第三方催收公司、律师事务所等 。</text>
        <text class="content">乐开花有义务根据有关法律要求向司法机关和政府部门提供您的个人资料。在您未能按照与本协议、乐开花有关规则或者与乐开花其他用户签订的有关协议的约定履行自己应尽的义务时（包括但不限于当您作为借款人借款逾期或有其他违约时），乐开花有权根据自己的判断、有关协议和规则、国家生效裁决文书或者与该笔交易有关的其他用户的合理请求披露您的个人资料（包括但不限于在乐开花及互联网络上公布您的违法、违约行为，并有关将该内容记入任何与您相关的信用资料、档案或数据库），并且作为出借人的其他用户可以采取发布您的个人信息的方式追索债权或通过司法部门要求乐开花提供相关资料，乐开花对此不承担任何责任。</text>
        <text class="content">（3）您对其他用户信息的使用</text>
        <text class="content">在乐开花提供的交易活动中，您无权要求乐开花提供其他用户的个人资料，除非符合以下条件：</text>
        <text class="content">（3.1） 您已向法院起诉其他用户的在乐开花活动中的违约行为；</text>
        <text class="content">（3.2） 与您有关的其他用户逾期未归还借款本息；</text>
        <text class="content">（3.3） 乐开花被吊销营业执照、解散、清算、宣告破产或者其他有碍于您收回借款本息的情形。</text>
        <text class="content">如您通过签署有关协议等方式获得其他用户的个人信息，您同意不将该等个人信息用于除还本付息或向借款人追索债权以外的其他任何用途，除非该等信息根据适用的法律规定、被有管辖权的法院或政府部门要求披露。</text>
        <text class="content strong">16、免责条款</text>
        <text class="content">乐开花是一个开放平台，用户将文字或图片等个人资料上传到互联网上，有可能会被其他组织或个人复制、转载、篡改或用于其它非法用途，用户必须充分意识此类风险的存在。作为网络服务的提供者，我们对用户在任何论坛、个人主页或其它互动区域提供的任何陈述、声明或内容均不承担责任。您明确同意使用乐开花所存在的风险或产生的一切后果将完全由您自身承担，我们对上述风险或后果不承担责任。</text>
        <text class="content">（1） 您违反本服务条款、违反道德或法律的，侵犯他人权利（包括但不限于知识产权）的，我们不承担任何责任。同时，我们对任何第三方通过乐开花发送服务或包含在服务中的任何内容不承担责任。</text>
        <text class="content">（2）对您、其他用户或任何第三方发布、存储或上传的任何内容或由该等内容导致的任何损失或损害，我们不承担责任。</text>
        <text class="content">（3） 对任何第三方通过乐开花可能对您造成的任何诽谤、中伤、诬蔑、亵渎或其他伤害和损失，我们不承担责任。</text>
        <text class="content">（4） 由于黑客行为、计算机病毒、或因您保管疏忽致使帐号、密码被他人非法使用、盗用、篡改或丢失，或由于与本网站链接的其它网站所导致的您个人资料的泄露，我们不承担责任。如您发现任何非法使用用户帐号的情况或安全漏洞，请立即与我们联系。</text>
        <text class="content">（5） 因任何非乐开花原因造成的网络服务中断或其他缺陷，我们不承担责任。</text>
        <text class="content">（6）我们不保证服务能完全满足您的要求；不保证服务不会中断，也不保证服务的及时性、安全性、准确性。</text>
    </view>
</template>
<script>
export default {
    name: 'agreement-register'
}
</script>
<style lang="scss" scoped>
@import '../../common/styles/defin';
.agreement-register {
    @include flex;
    width: 100%;
    padding: 0 44upx 50upx;
    justify-content: flex-start;
    .title {
        @include flex;
        width: 100%;
        padding: 50upx 0 4upx;
        align-items: flex-start;
        @include font-size(34upx, 50upx);
        color: #222222;
        font-weight: bold;
    }
    .content {
        @include flex;
        width: 100%;
        margin-top: 17upx;
        align-items: flex-start;
        @include font-size(26upx, 50upx);
        color: #222222;
        font-weight: 400;
        &.strong {
            margin-top: 37upx;
            font-weight: bold;
        }
    }
}
</style>

